{
  "Performance Management": {
    "Evaluatieprocessen en Opvolging": {
      "Structuur in functionerings- en evaluatiegesprekken": [
        "Gesprekken worden volgens een duidelijke planning georganiseerd.",
        "Gestandaardiseerde sjablonen en beoordelingscriteria zijn beschikbaar per functie.",
        "Evaluatoren hebben een volledig overzicht van eerdere functioneringsgesprekken.",
        "Evaluatieverslagen worden goed gedocumenteerd en bewaard.",
        "Er is een duidelijk onderscheid tussen functioneringsgesprekken en evaluatiegesprekken.",
        "Functioneringsgesprekken worden systematisch opgevolgd met concrete actiepunten."
      ],
      "Centrale plek voor evaluatiedocumentatie": [
        "Functiebeschrijving en evaluatiecriteria zijn gebundeld in één toegankelijk systeem.",
        "Medewerkers hebben toegang tot hun eigen evaluatieverslagen.",
        "Personeelsleden ontvangen automatische notificaties bij wijzigingen in evaluatiecriteria.",
        "Directies en HR kunnen eenvoudig bijhouden welke personeelsleden geëvalueerd moeten worden."
      ],
      "Automatische opvolging": [
        "Evaluatoren worden tijdig herinnerd aan geplande functionerings- en evaluatiegesprekken.",
        "Automatische herinneringen voor verplichte functioneringsgesprekken zijn ingesteld.",
        "Er is een tracking systeem voor afspraken en actiepunten uit functioneringsgesprekken.",
        "HR en directie kunnen controleren of evaluaties consistent worden uitgevoerd binnen de scholengroep."
      ]
    },
    "Transparantie en Beoordelingscriteria": {
      "Duidelijkheid over evaluatiecriteria": [
        "Medewerkers weten precies waarop ze beoordeeld worden.",
        "Evaluatoren gebruiken objectieve maatstaven met eenduidige richtlijnen.",
        "Er is een formele koppeling tussen functiebeschrijvingen en evaluatierapporten.",
        "Functiebeschrijvingen worden regelmatig geactualiseerd en zijn volledig."
      ],
      "Uniforme evaluatieaanpak binnen een scholengroep": [
        "Alle scholen binnen een scholengroep hanteren dezelfde criteria en aanpak.",
        "Verschillende evaluatoren interpreteren criteria op dezelfde manier.",
        "Er is een benchmark of vergelijking mogelijk tussen scholen en teams."
      ],
      "Duidelijke bezwaarprocedure bij negatieve evaluaties": [
        "Personeelsleden weten precies hoe ze in beroep kunnen gaan tegen een negatieve evaluatie.",
        "Er is een automatische melding wanneer een evaluatie bezwaarlijk kan zijn.",
        "Evaluatoren hebben een duidelijk proces om bezwaren correct af te handelen."
      ]
    },
    "Feedback en 360° Evaluatie": {
      "Sterke feedbackcultuur": [
        "Feedback gebeurt in alle richtingen: top-down, bottom-up en van peers en mentoren.",
        "Medewerkers voelen zich betrokken bij hun eigen groei en ontwikkeling.",
        "Er zijn mogelijkheden voor zelfreflectie en het actief bijhouden van prestaties."
      ],
      "360° evaluatie (input van collega's, mentoren, leerlingen)": [
        "Evaluaties zijn veelzijdig en houden rekening met feedback van collega's.",
        "Mentoren kunnen objectieve feedback geven op de ontwikkeling van nieuwe medewerkers.",
        "Leerlingenfeedback wordt meegenomen bij de beoordeling van leerkrachten."
      ],
      "Registratie van feedbackmomenten": [
        "Feedback uit informele gesprekken wordt vastgelegd.",
        "Er is een centrale plek waar feedback wordt opgeslagen voor latere evaluaties.",
        "Evaluatoren kunnen trends in prestaties over meerdere jaren detecteren."
      ]
    },
    "Professionele Ontwikkeling en Coaching": {
      "Evaluatie leidt tot concrete groeiplannen": [
        "Functioneringsgesprekken worden systematisch gekoppeld aan een concreet ontwikkelingsplan.",
        "Evaluatoren hebben volledig inzicht in de opleidingshistoriek van medewerkers.",
        "HR en directie kunnen trends in professionele groei analyseren."
      ],
      "Gestructureerde opvolging van verbeterpunten": [
        "Medewerkers krijgen verbeterpunten met een tool om deze op te volgen.",
        "HR en directie kunnen zien welke personeelsleden extra coaching nodig hebben.",
        "Er wordt gebruik gemaakt van duidelijke KPI's voor professionele groei."
      ],
      "Mentoring en coaching zijn ingebed in het systeem": [
        "Mentoren kunnen gestructureerde feedback geven.",
        "Coachingstrajecten worden geregistreerd en opgevolgd.",
        "Er is een plek waar medewerkers hun eigen ontwikkelingsdoelen kunnen bijhouden."
      ]
    },
    "Data & Beleidsvorming": {
      "Inzichten in personeelsontwikkeling": [
        "HR en directie hebben complete data over prestaties en groei van personeelsleden.",
        "Er is mogelijkheid om prestaties tussen scholen of teams binnen een scholengroep te vergelijken.",
        "Prestaties van tijdelijke en vaste medewerkers kunnen over de jaren heen worden vergeleken."
      ],
      "Evaluatiegegevens geïntegreerd in bredere HR-processen": [
        "Er is een koppeling tussen evaluatiedata en beslissingen over promotie of benoeming.",
        "Evaluatiegegevens worden gebruikt in strategische HR-planning.",
        "Prestaties van tijdelijke en vaste medewerkers kunnen over de jaren heen worden vergeleken."
      ],
      "Overzicht van verplichte functionerings- en evaluatiegesprekken": [
        "HR en directie weten precies welke gesprekken nog moeten plaatsvinden.",
        "Er zijn statistieken beschikbaar over het aantal gevoerde gesprekken per jaar.",
        "Audits of inspecties worden probleemloos doorstaan dankzij complete data."
      ]
    },
    "Compliance & Wettelijke Vereisten": {
      "Voldoen aan wettelijke verplichtingen": [
        "Functioneringsgesprekken worden systematisch uitgevoerd conform de wettelijke verplichting.",
        "Personeelsleden krijgen de evaluatie en coaching waar ze recht op hebben.",
        "Evaluatieprocessen sluiten naadloos aan bij decreten en regelgeving voor Vlaamse scholen."
      ],
      "Correcte opvolging van Tijdelijke Aanstelling van Doorlopende Duur (TADD)": [
        "Er is automatische controle of medewerkers in aanmerking komen voor TADD.",
        "Personeelsleden weten precies wat ze moeten doen om hun TADD-status te behalen.",
        "HR heeft een volledig overzicht van wie al dan niet voldoet aan TADD-voorwaarden."
      ]
    },
    "Gebruikersvriendelijkheid & Digitale Ervaringen": {
      "Eenvoudige toegang tot evaluatiesystemen": [
        "HR-tools zijn geïntegreerd in één gebruiksvriendelijk platform.",
        "Directeurs en HR kunnen documenten eenvoudig vinden en opslaan.",
        "Evaluatieformulieren zijn gestandaardiseerd en gemakkelijk digitaal in te vullen."
      ],
      "Integratie met bestaande HR-systemen": [
        "Er is een volledige koppeling met Agodi, Diplo en iPersoneel.",
        "Evaluaties en functiebeschrijvingen zijn gelinkt aan personeelsdossiers.",
        "Gebruikers kunnen data automatisch overzetten van het ene systeem naar het andere."
      ]
    }
  },
  "Recruitment & Onboarding": {
    "Vacaturebeheer & Publicatie": {
      "Gestroomlijnd proces voor vacaturecreatie": [
        "Vacatures worden opgesteld met standaard sjablonen.",
        "Directies en HR-medewerkers kunnen snel en efficiënt vacatures maken.",
        "Er is mogelijkheid om vacaturebeschrijvingen uit het verleden te hergebruiken."
      ],
      "Eenvoudige verspreiding van vacatures": [
        "Vacatures worden automatisch gepubliceerd op verschillende platforms (VDAB, LinkedIn, schoolwebsites).",
        "Er is volledige integratie tussen vacaturebeheer en externe jobportalen.",
        "Vacatures kunnen eenvoudig worden doorgeplaatst op sociale media of via interne communicatienetwerken."
      ],
      "Tracking en opvolging van vacatures": [
        "Er is een duidelijk overzicht van actieve en gesloten vacatures binnen een school of scholengroep.",
        "Het aantal sollicitanten per vacature wordt automatisch bijgehouden.",
        "Het succes van verschillende wervingskanalen kan gemeten worden."
      ]
    },
    "Sollicitatiebeheer": {
      "Eenvoudige en gestroomlijnde sollicitatieprocedure": [
        "Kandidaten kunnen hun sollicitaties digitaal indienen via een gebruiksvriendelijk platform.",
        "Er is een uniform sollicitatieformulier voor alle vacatures.",
        "Kandidaten ontvangen automatisch een bevestiging van ontvangst."
      ],
      "Efficiënte administratie en tracking van sollicitanten": [
        "Directie en HR hebben een duidelijk overzicht van alle sollicitanten per vacature.",
        "Er zijn uitgebreide filtermogelijkheden om kandidaten snel te zoeken op diploma, ervaring of specialisatie.",
        "Kandidaten kunnen eenvoudig vergeleken en beoordeeld worden met gestandaardiseerde beoordelingscriteria."
      ],
      "Gestroomlijnd feedback- en afwijsproces": [
        "Kandidaten krijgen tijdig terugkoppeling over hun sollicitatie.",
        "Directies en HR-medewerkers beschikken over standaard e-mailsjablonen voor afwijzingen en uitnodigingen.",
        "Feedback van gesprekken kan intern gestructureerd gedeeld worden tussen HR en directie."
      ]
    },
    "Selectie & Beoordeling": {
      "Objectief en gestructureerd selectieproces": [
        "Directies en HR-medewerkers selecteren kandidaten op basis van duidelijke beoordelingscriteria.",
        "Er zijn scoringssystemen om kandidaten objectief met elkaar te vergelijken.",
        "Sollicitatiegesprekken worden goed voorbereid met behulp van een centrale database met kandidaatgegevens."
      ],
      "Gestructureerde interviewprocessen": [
        "Sollicitatiegesprekken worden systematisch ingepland volgens een duidelijke workflow.",
        "Er zijn standaardvragenlijsten en beoordelingscriteria voor interviews.",
        "Feedback over kandidaten wordt op een gestructureerde manier vastgelegd."
      ],
      "Coördinatie tussen verschillende betrokkenen bij het selectieproces": [
        "Verschillende mensen (directie, HR, vakcoördinatoren) delen informatie via een gezamenlijke tool.",
        "Sollicitaties kunnen parallel door meerdere personen beoordeeld worden.",
        "HR-medewerkers kunnen efficiënt sollicitaties coördineren en doorsturen."
      ]
    },
    "Talent Pools & Wervingsreserves": {
      "Centrale database met potentiële kandidaten": [
        "HR en directie kunnen een historiek van eerdere sollicitanten raadplegen.",
        "Goede kandidaten uit het verleden worden opnieuw benaderd.",
        "Interessante kandidaten uit een vorige sollicitatieronde worden opgeslagen en hergebruikt."
      ],
      "Pool van vervangers voor snelle inzet": [
        "Er is een centrale lijst met beschikbare interim-leerkrachten of vervangers.",
        "Bij ziekte of onverwachte afwezigheid kan snel een vervanger gevonden worden.",
        "Er is automatische matching tussen beschikbare kandidaten en openstaande vacatures."
      ],
      "Up-to-date beschikbaarheidsbeheer voor kandidaten": [
        "Kandidaten in de talentpool kunnen hun beschikbaarheid aangeven.",
        "Directies en HR-medewerkers zien direct wie beschikbaar is zonder handmatig contact te moeten opnemen.",
        "Er is automatische matching tussen openstaande vacatures en kandidaten die beschikbaar zijn."
      ]
    },
    "Onboarding & Startende Medewerkers": {
      "Gestructureerde onboarding voor nieuwe medewerkers": [
        "Startende medewerkers krijgen een duidelijke introductie over hun school en hun rol.",
        "Er is een uniform onboardingtraject voor nieuwe leerkrachten binnen een scholengroep.",
        "Belangrijke documenten (functieomschrijving, beleidsdocumenten) worden digitaal gedeeld."
      ],
      "Mentoring en begeleiding in de eerste maanden": [
        "Nieuwe medewerkers krijgen een mentor of coach toegewezen.",
        "Er is een gestructureerd systeem voor opvolging van startende leerkrachten.",
        "De effectiviteit van onboarding wordt gemeten en startende medewerkers voelen zich voldoende ondersteund."
      ],
      "Onboarding is gekoppeld aan HR-administratie": [
        "HR kan contracten en documenten automatisch verzamelen van nieuwe medewerkers.",
        "Er is automatische koppeling met personeelsdossiers en loonadministratie.",
        "Nieuwe medewerkers hoeven hun gegevens slechts eenmaal aan te leveren."
      ]
    },
    "Compliance & Wettelijke Vereisten": {
      "Voldoen aan wettelijke verplichtingen rond TADD en TABD": [
        "Er is automatische controle of tijdelijke leerkrachten voldoen aan de vereisten voor TADD.",
        "Het juiste moment waarop een medewerker in aanmerking komt voor vastbenoeming wordt automatisch bepaald.",
        "HR en directies kunnen digitaal opvolgen wie in aanmerking komt voor doorlopende duur."
      ],
      "Correcte registratie van verplichte aanvangsbegeleiding": [
        "Nieuwe medewerkers volgen een gestructureerde verplichte aanvangsbegeleiding.",
        "Er is een centrale plek waar mentorverslagen en opvolgdocumenten worden bijgehouden.",
        "Aan inspectie of regelgeving wordt voldaan dankzij gestructureerde rapportage."
      ]
    },
    "Gebruiksvriendelijkheid & Digitalisering": {
      "Minimale administratieve last bij directies en HR": [
        "Wervings- en onboardingprocessen zijn geautomatiseerd en efficiënt.",
        "Directies en HR kunnen kandidaten automatisch door de selectieprocedure loodsen.",
        "Gegevens worden eenmalig ingevoerd en automatisch gedeeld tussen systemen."
      ],
      "Integratie met bestaande HR-systemen": [
        "Er is automatische koppeling met Agodi en iPersoneel.",
        "Personeelsgegevens worden automatisch overgezet naar de HR-database.",
        "Rekrutering en onboarding zijn gekoppeld aan personeelsplanning."
      ],
      "Duidelijk overzicht voor kandidaten": [
        "Sollicitanten weten precies waar ze staan in het selectieproces.",
        "Er is een persoonlijke login of dashboard waar kandidaten hun status kunnen volgen.",
        "Communicatie met kandidaten verloopt gestructureerd."
      ]
    }
  },
  "Self Service Portal": {
    "Persoonlijke Gegevensbeheer": {
      "Centrale plek om persoonlijke gegevens te beheren": [
        "Personeelsleden kunnen wijzigingen in persoonlijke gegevens (adres, telefoonnummer, noodcontacten) digitaal doorgeven.",
        "Er is een selfserviceportaal waarin medewerkers hun eigen gegevens kunnen aanpassen.",
        "HR-medewerkers besteden minimale tijd aan het bijwerken van gegevens."
      ],
      "Automatische koppeling met HR-systemen": [
        "Er is automatische synchronisatie met Agodi en iPersoneel.",
        "Personeelsleden hoeven hun gegevens slechts eenmaal door te geven voor verschillende doeleinden (verlofaanvraag, contractwijziging, loonadministratie).",
        "Er is volledige koppeling tussen persoonlijke gegevens en schoolgebonden administratieve processen."
      ],
      "Mogelijkheid om gezins- en zorgsituatie te registreren": [
        "Personeelsleden kunnen informatie over ouderschapsverlof, mantelzorg of gezinsuitbreiding doorgeven via een digitale tool.",
        "HR-afdeling heeft zicht op personeelsleden met specifieke verlofrechten (bv. voor zorgverlof).",
        "Er is een overzicht van personeelsleden die recht hebben op specifieke premies of tegemoetkomingen."
      ]
    },
    "Afwezigheden en Verlofaanvragen": {
      "Efficiënt proces voor verlofaanvragen": [
        "Personeelsleden kunnen verlof aanvragen via een digitaal platform.",
        "HR kan verlofaanvragen automatisch verwerken zonder fouten.",
        "Medewerkers kunnen hun resterend verlofsaldo zelf raadplegen."
      ],
      "Digitaal goedkeuringsproces": [
        "Directeurs en HR-medewerkers kunnen verlofaanvragen digitaal goedkeuren en registreren.",
        "Er is een geautomatiseerde workflow om goedkeuringen te stroomlijnen.",
        "Personeelsleden worden automatisch geïnformeerd wanneer hun verlof is goedgekeurd."
      ],
      "Overzicht van verlof- en ziektehistoriek": [
        "Personeelsleden kunnen hun historische afwezigheden raadplegen.",
        "HR en directie hebben zicht op afwezigheidspatronen.",
        "Er zijn automatisch gegenereerde rapporten over afwezigheden per schooljaar."
      ],
      "Digitaal proces voor ziekteverlof": [
        "Personeelsleden kunnen ziekteverlof online registreren.",
        "Er is mogelijkheid om een doktersattest digitaal te uploaden.",
        "HR-medewerkers kunnen ziektemeldingen automatisch verwerken."
      ]
    },
    "Tijdregistratie en Uurroosters": {
      "Duidelijk overzicht van lesopdrachten en uurroosters": [
        "Personeelsleden weten precies welke lesuren ze hebben in een bepaalde periode.",
        "Directeurs kunnen eenvoudig inzien welke personeelsleden wanneer beschikbaar zijn.",
        "Wijzigingen in lesopdrachten worden real-time gecommuniceerd."
      ],
      "Mogelijkheid om overuren en extra prestaties te registreren": [
        "Leerkrachten kunnen overuren en vervangingen digitaal registreren.",
        "HR kan extra prestaties automatisch bijhouden en verwerken.",
        "Er is een geautomatiseerd systeem voor goedkeuring van overuren."
      ],
      "Duidelijke rapportage over werkuren en inzetbaarheid": [
        "Er is een dashboard met overzicht van gewerkte uren per maand of schooljaar.",
        "Er wordt een historiek bijgehouden van werkbelasting en contractuele inzetbaarheid.",
        "HR en directie hebben geautomatiseerde rapporten over inzetbaarheid."
      ]
    },
    "Loon- en Financiële Administratie": {
      "Digitaal overzicht van loonfiches en fiscale documenten": [
        "Personeelsleden kunnen hun loonfiches digitaal raadplegen.",
        "Er is een centraal digitaal archief waar medewerkers hun fiscale attesten kunnen terugvinden.",
        "HR kan looninformatie automatisch verstrekken bij vragen."
      ],
      "Mogelijkheid om onkostenvergoedingen digitaal in te dienen": [
        "Personeelsleden kunnen kilometervergoeding of terugbetalingen van aankopen digitaal aanvragen.",
        "HR kan automatisch berekenen en verwerken welke onkosten vergoed worden.",
        "Er is een geautomatiseerd goedkeuringsproces voor declaraties."
      ],
      "Duidelijk overzicht van loongegevens en premies": [
        "Personeelsleden kunnen digitaal nagaan hoeveel zij verdienen en hoe hun loon is opgebouwd.",
        "Er is een overzicht van opgebouwde anciënniteit en toekomstige loonsverhogingen.",
        "Medewerkers kunnen eenvoudig inzien welke premies of extra vergoedingen ze kunnen krijgen."
      ]
    },
    "Professionele Ontwikkeling en Evaluatie": {
      "Overzicht van gevolgde opleidingen en nascholingen": [
        "Personeelsleden hebben een digitaal overzicht van hun gevolgde opleidingen.",
        "HR en directie hebben een centraal overzicht van professionele ontwikkeling per personeelslid.",
        "Verplichte nascholingen worden automatisch getrackt."
      ],
      "Mogelijkheid om zich digitaal in te schrijven voor vormingen": [
        "Personeelsleden kunnen opleidingen digitaal aanvragen.",
        "Er is een digitaal overzicht van beschikbare bijscholingen of verplichte vormingen.",
        "HR heeft een geautomatiseerd systeem om inschrijvingen te beheren."
      ],
      "Digitaal dossier met evaluaties en functioneringsgesprekken": [
        "Personeelsleden kunnen hun functioneringsgesprekken en feedback eenvoudig raadplegen.",
        "HR en directie kunnen bijhouden welke personeelsleden al geëvalueerd zijn.",
        "Er is automatische opvolging van actiepunten uit evaluaties."
      ]
    },
    "Mobiliteit en Loopbaanbeheer": {
      "Toegang tot interne vacatures en mobiliteitsmogelijkheden": [
        "Personeelsleden weten welke interne vacatures openstaan binnen de scholengroep.",
        "Er is mogelijkheid om intern te solliciteren voor een andere functie.",
        "HR kan nagaan welke personeelsleden geïnteresseerd zijn in interne mobiliteit."
      ],
      "Inzicht in loopbaanontwikkeling en anciënniteit": [
        "Personeelsleden weten hoe hun loopbaantraject binnen de scholengroep eruitziet.",
        "Er is een overzicht van opgebouwde anciënniteit en rechten op verlof en bonussen.",
        "HR kan loopbaanpaden en doorgroeimogelijkheden digitaal communiceren."
      ]
    },
    "Communicatie en Feedback": {
      "Efficiënte communicatie over HR-zaken": [
        "Personeelsleden krijgen belangrijke HR-updates via een centraal platform met duidelijke opslag.",
        "Er zijn gestandaardiseerde communicatiekanalen voor HR-zaken.",
        "Medewerkers hebben eenvoudig toegang tot beleidsdocumenten en richtlijnen."
      ],
      "Digitaal ticketsysteem voor HR-vragen": [
        "HR ontvangt vragen via een gestructureerd ticketsysteem.",
        "Personeelsleden hebben een overzicht van ingediende HR-vragen en statussen.",
        "Er is een systeem voor automatische beantwoording van veelgestelde vragen."
      ]
    }
  }
}